{
  "$id": "1",
  "State": "SUCCESS",
  "Message": null,
  "UserFriendlyMessage": null,
  "Exception": null,
  "Data": {
    "$id": "2",
    "RecipeIngredients": [
      "4 sea scallops, cleaned",
      "1 tablespoon extra-virgin olive oil",
      "1 small shallot, finely diced",
      "4 ounces dry white wine",
      "pinch of saffron thread",
      "1 ounce lemon juice",
      "1 tablespoon heavy whipping cream",
      "6 tablespoons cold unsalted butter, cubed",
      "1 tablespoon finely chopped chive",
      "salt and pepper, to taste"
    ],
    "RecipeSteps": [
      "For the beurre blanc, start by crushing the saffron threads either using a mortar and pestle or a spice grinder.  Combine 2 ounces of wine and the crushed saffron threads and let sit for a couple of minutes.",
      "Add remaining white wine, saffron wine mixture, shallot, lemon juice, a dash of salt and pepper to a medium saucepan.  Bring the mixture to a boil and let reduce until there is about a tablespoon left.  Add the cream and let it cook for about 1 minute.",
      "Remove the pan from heat and start adding butter one cube at a time, whisking well after each piece is added.  Taste the sauce and add more salt and pepper if needed.",
      "For the scallops, heat a heavy sauté pan over medium-high heat.  Add one tablespoon of oil and swirl the pan to coat evenly.  Add the scallops to the pan and let cook for 2 minutes.  Turn over scallops and let cook another 1-2 minutes, until done.",
      "For serving, pour about 2-3 tablespoons of saffron beurre blanc into the bottom of a small plate.  Place 2 scallops on each plate.  Garnish with chopped chives.",
      "The base of this beurre blanc sauce was inspired by Alton Brown's Raymound Beurre Blanc recipe."
    ],
    "AllRecipeTips": [
      "Saffron is often expensive and hard to find.  It is important to remember that a little will go a long way.  I highly recommend The Spanish Table online store for stocking up on saffron as well as other Spanish specialties."
    ],
    "AllRecipeUrls": [
      {
        "$id": "3",
        "LinkTitle": "The Spanish Table",
        "LinkUrl": "http://www.thespanishtable.com/"
      }
    ],
    "CategoryIDs": [
      116,
      12,
      128,
      78,
      60,
      27,
      89,
      31,
      45
    ],
    "ID": 12,
    "Name": "Pan Seared Scallops with Saffron Beurre Blanc",
    "Description": "These succulent scallops with a delicate saffron beurre blanc sauce are great as a starter or first course.",
    "Author": "Amy Raynaud",
    "PrepTime": 10,
    "CookingTime": 15,
    "TotalTime": 25,
    "YieldCount": 2.000000,
    "YieldUnitTypeID": 6,
    "Source": "",
    "IsPersonal": true,
    "IsPublic": true,
    "IsImported": true,
    "RawText": null,
    "UserID": 1
  }
}